Documents/СрокиПроектаМонтаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СрокиПроектаМонтаж</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДатыКомплектаМонтаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплектаМонтаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КрайМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремениМонтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСотрудниковМонтаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыКомплектаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплектаПроизводство</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПодрядчик</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПодрядчик</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремениПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаЗнанийЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаЗнанийПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорпоративныйАккаунт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Софт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Софт</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Софт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квалификация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/СрокиПроектаМонтаж/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем мИзменений, ЕстиУдалениеКомплекта;

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьНачальноеЗначениеТЧ();
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ЗаполнитьПодпись(Объект.Проект));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЕстиУдалениеКомплекта = Ложь;
	ЭтаФорма.ТолькоПросмотр = ЗначениеЗаполнено(ЭтаФорма.ДатаПодписи);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если мИзменений.Количество() > 0 Тогда
		
		ЗаписатьВРегистрНаСервере(мИзменений, Объект.Проект);	
		
	КонецЕсли;
	ЗаполнитьНачальноеЗначениеТЧ();
КонецПроцедуры


#КонецОбласти


#Область СобытияФормыПродолжение

&НаСервереБезКонтекста
Функция ЗаполнитьПодпись(Сделка)
	
	Если ЗначениеЗаполнено(Сделка) Тогда
		Возврат омПроекты.ПодписьСделки(Сделка);
	КонецЕсли;
	
	Возврат Новый Структура("ДатаПодписи,АвторПодписи",Дата(1,1,1),ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));

КонецФункции // ЗаполнитьПодпись()

#КонецОбласти


#Область СобытиеРеквизитов

&НаКлиенте
Процедура ПодписатьПриИзменении(Элемент)
	Если Объект.Подписать Тогда
		Объект.ДатаПодписи = ТекущаяДата();
		Объект.АвторПодписи = ПолучитьТекущегоПользователя();
	Иначе	
		Объект.ДатаПодписи 	= Дата(1,1,1);
		Объект.АвторПодписи	= ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СделкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Объект.Комплекты.Количество() = 0 Тогда 
		ОткрытьФормуВыбораСделки();
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОСменеСделке",ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения,"При смене Проекты будет очищена табличная часть. Продоллжить?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура СделкаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


#КонецОбласти 


#Область СобытиеРеквизитовПродолжение

&НаКлиенте
Процедура ПослеВопросаОСменеСделке(Результат, ДополнительныйПараметр) Экспорт
    Если Результат = КодВозвратаДиалога.ДА Тогда
        ОткрытьФормуВыбораСделки();
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыборкаПроекта(Значение, ДополнительныйПараметр) Экспорт

    Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        Возврат;
	КонецЕсли;
	
	Элементы.Проект.СписокВыбора.Очистить();
	Элементы.Проект.СписокВыбора.Добавить(Значение);
	Объект.Проект = Значение;
	Объект.Комплекты.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ЗаполнитьПодпись(Объект.Проект));
		ЭтаФорма.ТолькоПросмотр = ЗначениеЗаполнено(ЭтаФорма.ДатаПодписи);
	Иначе
		ЭтаФорма.ДатаПодписи 	= Дата(1,1,1);
		ЭтаФорма.АвторПодписи 	= ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти 


#Область СобытияТЧ

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	ЕстиУдалениеКомплекта = Истина;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНачальноеЗначениеТЧ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплектаМонтаж.КрайМонтажа КАК КрайМонтажа,
		|	ЛОЖЬ КАК Изменен,
		|	ДатыКомплектаМонтаж.НачалоМонтажа КАК НачалоМонтажа,
		|	СрокиСделкиМонтажКомплекты.Комплект КАК Комплект,
		|	СрокиСделкиМонтажКомплекты.Комментарий КАК Комментарий,
		|	ДатыКомплектаМонтаж.КоличествоСотрудниковМонтаж КАК КоличествоСотрудниковМонтаж,
		|	ДатыКомплектаМонтаж.КоличествоСотрудниковМонтаж * ДатыКомплектаМонтаж.НормаВремениМонтажа КАК ЧеловекоДнейМонтаж,
		|	ДатыКомплектаМонтаж.НормаВремениМонтажа КАК НормаВремениМонтажа
		|ИЗ
		|	Документ.СрокиПроектаМонтаж.Комплекты КАК СрокиСделкиМонтажКомплекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплектаМонтаж КАК ДатыКомплектаМонтаж
		|		ПО СрокиСделкиМонтажКомплекты.Комплект = ДатыКомплектаМонтаж.Комплект
		|ГДЕ
		|	СрокиСделкиМонтажКомплекты.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатыКомплектаМонтаж.Комплект.Наименование";
	
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Объект.Комплекты.Загрузить(Запрос.Выполнить().Выгрузить());
КонецФункции // ЗаполнитьНачальноеЗначениеТЧ()    

&НаСервереБезКонтекста
Функция ПолучитьданныеКомплекта(Комплекты)

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплектаМонтаж.КрайМонтажа КАК КрайМонтажа,
		|	ДатыКомплектаМонтаж.НачалоМонтажа КАК НачалоМонтажа
		|ИЗ
		|	РегистрСведений.ДатыКомплектаМонтаж КАК ДатыКомплектаМонтаж
		|ГДЕ
		|	ДатыКомплектаМонтаж.Комплект = &Комплект";
	

 		
		Запрос.УстановитьПараметр("Комплект", Комплекты);
		тзДанныеКомплека = Запрос.Выполнить().Выгрузить();
		
		ПустаяДата = Дата(1,1,1);
		Если тзДанныеКомплека.Количество() = 0 Тогда
			стрВозврата = Новый Структура("Комплект,КрайМонтажа,НачалоМонтажа"
										,Комплекты,
										,ПустаяДата
										,ПустаяДата);	
			мВозврата = Новый Массив(1);
			мВозврата[0] = стрВозврата;
			Возврат мВозврата;
		Иначе
			Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(тзДанныеКомплека);
		КонецЕсли;

КонецФункции // ПолучитьданныеКомплекта()
 
&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Если Копирование Тогда
	    ПоказатьПредупреждение(,"Запрещен ввод копированием строки."); 
	ИначеЕсли ЗначениеЗаполнено(Объект.Проект) Тогда
		НС = Объект.Комплекты.Добавить();
		КомплектыКомплектНачалоВыбора(Элемент.ПодчиненныеЭлементы.КомплектыКомплект,НС,Неопределено);	
	Иначе
	    ПоказатьПредупреждение(,"Не заполнена Проект."); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКомплекта(Значение, ДополнительныйПараметр) Экспорт

    Если Значение = Неопределено Тогда  
        Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДополнительныйПараметр.ТекущиеДанные, ПолучитьданныеКомплекта(Значение)[0]);

	ПриИзменениеДатыТЧ();
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыКрайТЗПриИзменении(Элемент)
	ПриИзменениеДатыТЧ();
КонецПроцедуры


&НаКлиенте
Процедура КомплектыПриИзменении(Элемент = Неопределено)
	Объект.КрайМонтажа = Дата(1,1,1);
	
	Для каждого х Из Объект.Комплекты Цикл
		Если х.КрайМонтажа > Объект.КрайМонтажа Тогда
			Объект.КрайМонтажа = х.КрайМонтажа;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыКомплектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДополнительныйПараметр = Новый Структура("ТекущиеДанные", ?(ДанныеВыбора = Неопределено, Элемент.Родитель.ТекущиеДанные, ДанныеВыбора));
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораКомплекта",ЭтаФорма,ДополнительныйПараметр);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Ложь);
	ПараметрыФормы.Вставить("Проект",Объект.Проект);
	
	НеПоказыватьВВыборе = Новый Массив;
	
	Для каждого х Из Объект.Комплекты Цикл
	
		НеПоказыватьВВыборе.Добавить(х.Комплект);	
	
	КонецЦикла;
	ПараметрыФормы.Вставить("НеПоказыватьВВыборе",НеПоказыватьВВыборе);
	
	ОткрытьФорму("Справочник.МонтажныеКомплекты.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры



#КонецОбласти 


#Область СобытияТЧПродолжение

&НаКлиенте
Процедура ПриИзменениеДатыТЧ()

	ТД = Элементы.Комплекты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТД.Изменен = Истина;
	
	
КонецПроцедуры // ПриИзменениеДатыТЧ()

&НаКлиенте
Процедура КомплектыНормаВремени_МонтажаПриИзменении(Элемент)
	ПриИзменениеДатыТЧ();
	ТД = Элементы.Комплекты.ТекущиеДанные;
	ТД.ЧеловекоДнейМонтаж 	= ТД.КоличествоСотрудниковМонтаж * ТД.НормаВремениМонтажа;
	ТД.НачалоМонтажа 		= омМонтажКлиент.РасчетНачалаДатыМонтажа(ТД);
КонецПроцедуры

&НаКлиенте
Процедура КомплектыКрайМонтажаПриИзменении(Элемент)
	ПриИзменениеДатыТЧ();
	ТД = Элементы.Комплекты.ТекущиеДанные;
	ТД.НачалоМонтажа = омМонтажКлиент.РасчетНачалаДатыМонтажа(ТД);
КонецПроцедуры

&НаКлиенте
Процедура КомплектыКоличествоСотрудниковМонтажПриИзменении(Элемент)
	ПриИзменениеДатыТЧ();
	ТД = Элементы.Комплекты.ТекущиеДанные;
	ТД.ЧеловекоДнейМонтаж = ТД.КоличествоСотрудниковМонтаж * ТД.НормаВремениМонтажа;
КонецПроцедуры

#КонецОбласти 


#Область Команды

&НаКлиенте
Процедура ЗаполнитьКомплекты(Команда)
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		ЗаполнитьКомплектыНаСервере();
		КомплектыПриИзменении();
	Иначе	
	    ПоказатьПредупреждение(,"Не заполнена Проект.");
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область КомандыПродолжение

&НаСервере
Процедура ЗаполнитьКомплектыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СрокиСделкиМонтажКомплекты.Комплект КАК Комплект
		|ПОМЕСТИТЬ втСуществующиеКомплекты
		|ИЗ
		|	Документ.СрокиПроектаМонтаж.Комплекты КАК СрокиСделкиМонтажКомплекты
		|ГДЕ
		|	СрокиСделкиМонтажКомплекты.Ссылка.Проект = &Проект
		|	И СрокиСделкиМонтажКомплекты.Ссылка <> &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДатыКомплектаПроизводство.НачалоПроизводства КАК НачалоПроизводства,
		|	ДатыКомплектаПроизводство.КрайПроизводства КАК КрайПроизводства,
		|	ИзделияКомплект.Ссылка КАК Комплект
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплектаПроизводство КАК ДатыКомплектаПроизводство
		|		ПО (ДатыКомплектаПроизводство.Комплект = ИзделияКомплект.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ втСуществующиеКомплекты КАК втСуществующиеКомплекты
		|		ПО (втСуществующиеКомплекты.Комплект = ИзделияКомплект.Ссылка)
		|ГДЕ
		|	ИзделияКомплект.Проект = &Проект
		|	И НЕ ИзделияКомплект.Ссылка В (&Комплекты)
		|	И НЕ ИзделияКомплект.ЭтоГруппа
		|	И втСуществующиеКомплекты.Комплект ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	Запрос.УстановитьПараметр("Комплекты", Объект.Комплекты.Выгрузить().ВыгрузитьКолонку("Комплект"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.Комплекты.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьКомплектыНаСервере()


#КонецОбласти

&НаСервереБезКонтекста
Процедура ЗаписатьВРегистрНаСервере(мИзменений,Сделка)

	Для каждого х Из мИзменений Цикл
	
		МенеджерЗаписей = РегистрыСведений.ДатыКомплектаМонтаж.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Комплект = х.Комплект;
		МенеджерЗаписей.Прочитать();
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписей,х);
		МенеджерЗаписей.Проект = Сделка;
		МенеджерЗаписей.Записать();
	
	КонецЦикла;	

КонецПроцедуры // ЗаписатьВРегистрНаСервере()

 &НаСервереБезКонтекста
Процедура ПроверитьУдалениеКомплекта(мКомплекты, Сделка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплектаМонтаж.Комплект КАК Комплект
		|ИЗ
		|	РегистрСведений.ДатыКомплектаМонтаж КАК ДатыКомплектаМонтаж
		|ГДЕ
		|	ДатыКомплектаМонтаж.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если мКомплекты.Найти(Выборка.Комплект) = Неопределено Тогда
			НаборЗаписей = РегистрыСведений.ДатыКомплектаМонтаж.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Комплект.Установить(Выборка.Комплект);
			
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры // 	ПроверитьУдалениеКомплекта(мКомплекты);¶()

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()

	Возврат ПараметрыСеанса.ТекущийПользователь;

КонецФункции // ПолучитьТекущегоПользователя()

&НаКлиенте
Процедура ОткрытьФормуВыбораСделки()
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",						Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",				Ложь);
	ПараметрыФормы.Вставить("ОтсутствующиеВПланированииСделки",	Истина);
	ПараметрыФормы.Вставить("НаименованиеСрока",				"СрокиПроектаМонтаж");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыборкаПроекта", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры // ОткрытьФормуВыбораСделки()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	мИзменений = Новый Массив;
	
	Для каждого х Из Объект.Комплекты Цикл
		Если х.Изменен Тогда
			стСтрока = Новый Структура("КрайМонтажа,НачалоМонтажа,Комплект,НормаВремениМонтажа,КоличествоСотрудниковМонтаж", );
			ЗаполнитьЗначенияСвойств(стСтрока, х);
			мИзменений.Добавить(стСтрока);
			х.Изменен = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
